# -*- coding: utf-8 -*-
from __future__ import unicode_literals


question_list = {
    '1': {'id': 1, 'title': 'First question', 'text': 'about first question'},
    '2': {'id': 2, 'title': 'Second question', 'text': 'about second question'},
    '3': {'id': 3, 'title': 'Third question', 'text': 'about third question'},
    '100': {'id': 100, 'title': 'Hundred question', 'text': 'about hundred question'},
}

Username = {'secondname': "Трубников", 'firstname': "Дмитрий" }

tags_list = ["CSS", "HTML", "Cpp", "Python", "Java", "ТехноПарк",
             "Си ", "Алгоритмы", "vk", "Ngnix", "Django", "Proxy", "Cache"]

best_user = [
    "Краснов Никита",
    "Шаталюк Женя",
    "Кузьмин Женя",
    "Гнедов Сеня",
    "Дружинин Игорь",
    "Лёха Пёс",
    "Кирилин Димон"
]

Post1 = {
    'mark': "+5",
    'title': "Элементы формы?",
    'text': "Отдельные элементы формы имеют свой стиль, но без обязательного класса или каких-либо особых изменений в разметке. В результате получаются...",
    'amount_answer': 2,
    'tags': ["HTML", "nGnix", "CSS"]
}
Post2 = {
    'mark': "+1",
    'title': "Как реализовать очередь на 6 стеках?",
    'text': "Отдельные элементы формы имеют свой стиль, но без обязательного класса или каких-либо особых изменений в разметке. В результате получаются...",
    'amount_answer': 5,
    'tags': ["С++", "алгоритмы"]
}
Post3 = {
    'mark': "-7",
    'title': "Как сдать курсач?",
    'text': "Отдельные элементы формы имеют свой стиль, но без обязательного класса или каких-либо особых изменений в разметке. В результате получаются...",
    'amount_answer': 11,
    'tags': ["Радиоэлектроника"]
}
Post4 = {
    'mark': "+3",
    'title': "Приоритет селекторов в CSS",
    'text': "Отдельные элементы формы имеют свой стиль, но без обязательного класса или каких-либо особых изменений в разметке. В результате получаются...",
    'amount_answer': 10,
    'tags': ["CSS", "Селекторы"]
}
Answer1 = {
    'mark': "+3",
    'title': "Приоритет селекторов в CSS",
    'text': "Переход к декартовым координатам из сферических осуществляется явно не по этой формуле:  Ψ(ρ,Θ,β)=ρ*sin(θ) + ρ*cos(β)",
    'amount_answer': 2,
    'tags': ["CSS", "Селекторы"]
}
Answer2 = {
    'mark': "+9",
    'title': "Приоритет селекторов в CSS",
    'text': "Отдельные элементы формы имеют свой стиль, но без обязательного класса или каких-либо особых изменений в разметке. Без особых изменений в разметке. Отдельные формы имеют свой стиль, но без обязательного класса или каких-либо особых изменений в разметке. Много текста, чтобы убедиться, что чекбокс будет располагаться в правильном месте при любой длине сообщения.",
    'amount_answer': 10,
    'tags': ["CSS", "Селекторы"]
}

many_post = [Post1, Post2, Post3, Answer1, Answer2, Post4, Post3, Answer1, Post1, Post2, Post4, Post3, Answer1]